source("Lib.R")

con <- dbConnect(dbDriver("PostgreSQL"),
                 host = "geoserver.mosecom.ru",
                 dbname = "DEV",
                 user = "MiroshnichenkoAD",
                 password = "Hornetm3",
                 port =5432 )
#открываем SQL 
query <-
  "
select distinct \"Intake_ID\", st_x(st_centroid(\"Intakes\".geom)), st_y(st_centroid(\"Intakes\".geom))  from \"Intakes\" left join \"Wells\"  using(\"Intake_ID\") where \"Well_ID\" in (219900,
202324,202323,202325,201269,201272,201271,201270,247966,202288,202284,247965,248096,
202327,212015,224472,202354,202328,202314,218338,201221,201220,212888,219853,219819,
247479,213094,213095,247951,202656,246572,202652,202651,246533,202658,202659,246157,
246158,246164,246165,247617,202631,240399,246641,202643,202642,202648,202649,202647,
202660,202661,202662,201279,224521,247288,247950,201205,201215,201211,209449,201197,
209448,201198,201744,201743,240276,240275,201769,201770,201736,246583,209442,209439,
209440,209441,209443,201762,203735,203736,246595,203733,248066,203730,248067,203734,
248065,218347,224514,224512,224511,248158,208295,247477,208297,224513,209371,248048,
209379,209376,203721,203722,203726,248064,209412,209411,209409,209418,209410,201173,
201172,201175,201178,201177,201185,201186,247909,201179,201180,201182,247746,246527,
201181,201183,201184,246434,219992,201209,201167,201168,211957,246500,249140,249141,
249388,204601,204602,277093,277094,277107,201161,201158,201162,201662,224462,201199,
219646,277060,277061,277078)
"
res <- dbGetQuery(con, query)
doc1 = read_docx(path = "203.docx")
doc1 = body_replace_all_text(doc1,
                      old_value ="\\{",
                      new_value = "")
doc1 = body_replace_all_text(doc1,
                             old_value ="\\}",
                             new_value = "")
print(doc1, target = "example_1.docx")


doc1 = read_docx(path = "example_1.docx")
doc1 = body_replace_all_text(doc1,
                             old_value ="we",
                             new_value = "Мы нижеподпишавшиеся")
doc1 = body_replace_all_text(doc1,
                             old_value ="surv3",
                             new_value = "Вася Пупкин")

print(doc1, target = "example_2.docx")


